In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [4]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,yellow_taxi_data,root,None,True,False,False,False
1,public,zones,root,None,True,False,False,False

In [6]:
query = """
SELECT *
FROM yellow_taxi_data
limit 1
"""

pd.read_sql(query, con=engine).T

                                         0
index                                    0
VendorID                                 1
tpep_pickup_datetime   2021-01-01 00:30:10
tpep_dropoff_datetime  2021-01-01 00:36:12
passenger_count                          1
trip_distance                          2.1
RatecodeID                               1
store_and_fwd_flag                       N
PULocationID                           142
DOLocationID                            43
payment_type                             2
fare_amount                            8.0
extra                                  3.0
mta_tax                                0.5
tip_amount                             0.0
tolls_amount                           0.0
improvement_surcharge                  0.3
total_amount                          11.8
congestion_surcharge                   2.5

In [20]:
query = """
SELECT *
FROM zones
limit 1
"""

pd.read_sql(query, con=engine).T

                           0
index                      0
LocationID                 1
Borough                  EWR
Zone          Newark Airport
service_zone             EWR

# 1)

In [15]:
query = """
SELECT count(*)
FROM yellow_taxi_data
WHERE DATE(tpep_pickup_datetime) = '2021-01-15'::date
"""

pd.read_sql(query, con=engine).T

           0
count  53024

# 2)

In [19]:
query = """
select DATE(tpep_pickup_datetime)
from yellow_taxi_data
where tip_amount =
(SELECT max(tip_amount)
FROM yellow_taxi_data
WHERE date_part('month', tpep_pickup_datetime) = 1)
"""

pd.read_sql(query, con=engine).T

               0
date  2021-01-20

# 3)

In [42]:
query = """
SELECT yellow_taxi_data."DOLocationID", zones."Zone", count(*) as count
FROM yellow_taxi_data
join zones on yellow_taxi_data."DOLocationID" = zones."LocationID"
WHERE DATE(tpep_pickup_datetime) = '2021-01-14'::date
group by yellow_taxi_data."DOLocationID", zones."Zone"
order by count desc
limit 1
"""

pd.read_sql(query, con=engine).T

                                  0
DOLocationID                    236
Zone          Upper East Side North
count                          3004

# 4)

In [ ]:
cand = df.groupby(['PULocationID', 'DOLocationID']).mean()[['total_amount']].sort_values('total_amount').tail(1)
cand = cand.reset_index()

In [43]:
query = """
SELECT zones1."Zone" as PULocation, zones2."Zone" as DOLocation, 
    avg(total_amount) as avg_total_amount
FROM yellow_taxi_data
join zones as zones1 on yellow_taxi_data."PULocationID" = zones1."LocationID"
join zones as zones2 on yellow_taxi_data."DOLocationID" = zones2."LocationID"
group by PULocation, DOLocation
order by avg_total_amount desc
limit 1
"""

pd.read_sql(query, con=engine).T

                              0
pulocation        Alphabet City
dolocation                 None
avg_total_amount         2292.4